cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432E401Y.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="I2C0">
      <name>I2C8</name>
      <prependToName>I2C8</prependToName>
      <baseAddress>0x400B8000</baseAddress>
      <interrupt><name>I2C8</name><value>109</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C0">
      <name>I2C9</name>
      <prependToName>I2C9</prependToName>
      <baseAddress>0x400B9000</baseAddress>
      <interrupt><name>I2C9</name><value>110</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C0">
      <name>I2C4</name>
      <prependToName>I2C4</prependToName>
      <baseAddress>0x400C0000</baseAddress>
      <interrupt><name>I2C4</name><value>70</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C0">
      <name>I2C5</name>
      <prependToName>I2C5</prependToName>
      <baseAddress>0x400C1000</baseAddress>
      <interrupt><name>I2C5</name><value>71</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C0">
      <name>I2C6</name>
      <prependToName>I2C6</prependToName>
      <baseAddress>0x400C2000</baseAddress>
      <interrupt><name>I2C6</name><value>102</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C0">
      <name>I2C7</name>
      <prependToName>I2C7</prependToName>
      <baseAddress>0x400C3000</baseAddress>
      <interrupt><name>I2C7</name><value>103</value></interrupt>
    </peripheral>
    <peripheral>
      <name>EPI0</name>
      <description>Register map for EPI0 peripheral</description>
      <groupName>EPI</groupName>
      <prependToName>EPI0</prependToName>
      <baseAddress>0x400D0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt><name>EPI0</name><value>50</value></interrupt>
      <registers>
        <register>
          <name>CFG</name>
          <description>EPI Configuration</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>EPI_CFG_MODE</name>
              <description>Mode Select</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_CFG_MODE_NONE</name>
                  <description>General Purpose</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_CFG_MODE_SDRAM</name>
                  <description>SDRAM</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_CFG_MODE_HB8</name>
                  <description>8-Bit Host-Bus (HB8)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_CFG_MODE_HB16</name>
                  <description>16-Bit Host-Bus (HB16)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_CFG_BLKEN</name>
              <description>Block Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EPI_CFG_INTDIV</name>
              <description>Integer Clock Divider Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BAUD</name>
          <description>EPI Main Baud Rate</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>EPI_BAUD_COUNT0</name>
              <description>Baud Rate Counter 0</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>EPI_BAUD_COUNT1</name>
              <description>Baud Rate Counter 1</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BAUD2</name>
          <description>EPI Main Baud Rate</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>EPI_BAUD2_COUNT0</name>
              <description>CS2n Baud Rate Counter 0</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>EPI_BAUD2_COUNT1</name>
              <description>CS3n Baud Rate Counter 1</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HB16CFG</name>
          <description>EPI Host-Bus 16 Configuration</description>
          <alternateGroup>EPI_ALT16</alternateGroup>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>EPI_HB16CFG_MODE</name>
              <description>Host Bus Sub-Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG_MODE_ADMUX</name>
                  <description>ADMUX - AD[15:0]</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG_MODE_ADNMUX</name>
                  <description>ADNONMUX - D[15:0]</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG_MODE_SRAM</name>
                  <description>Continuous Read - D[15:0]</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG_MODE_XFIFO</name>
                  <description>XFIFO - D[15:0]</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG_BSEL</name>
              <description>Byte Select Configuration</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG_RDWS</name>
              <description>Read Wait States</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG_RDWS_2</name>
                  <description>Active RDn is 2 EPI clocks</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG_RDWS_4</name>
                  <description>Active RDn is 4 EPI clocks</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG_RDWS_6</name>
                  <description>Active RDn is 6 EPI clocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG_RDWS_8</name>
                  <description>Active RDn is 8 EPI clocks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG_WRWS</name>
              <description>Write Wait States</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG_WRWS_2</name>
                  <description>Active WRn is 2 EPI clocks</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG_WRWS_4</name>
                  <description>Active WRn is 4 EPI clocks</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG_WRWS_6</name>
                  <description>Active WRn is 6 EPI clocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG_WRWS_8</name>
                  <description>Active WRn is 8 EPI clocks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG_MAXWAIT</name>
              <description>Maximum Wait</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG_BURST</name>
              <description>Burst Mode</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG_RDCRE</name>
              <description>PSRAM Configuration Register Read</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG_WRCRE</name>
              <description>PSRAM Configuration Register Write</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG_ALEHIGH</name>
              <description>ALE Strobe Polarity</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG_RDHIGH</name>
              <description>READ Strobe Polarity</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG_WRHIGH</name>
              <description>WRITE Strobe Polarity</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG_XFEEN</name>
              <description>External FIFO EMPTY Enable</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG_XFFEN</name>
              <description>External FIFO FULL Enable</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG_IRDYINV</name>
              <description>Input Ready Invert</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG_RDYEN</name>
              <description>Input Ready Enable</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG_CLKINV</name>
              <description>Invert Output Clock Enable</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG_CLKGATEI</name>
              <description>Clock Gated Idle</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG_CLKGATE</name>
              <description>Clock Gated</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GPCFG</name>
          <description>EPI General-Purpose Configuration</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>EPI_GPCFG_DSIZE</name>
              <description>Size of Data Bus</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_GPCFG_DSIZE_4BIT</name>
                  <description>8 Bits Wide (EPI0S0 to EPI0S7)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_GPCFG_DSIZE_16BIT</name>
                  <description>16 Bits Wide (EPI0S0 to EPI0S15)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_GPCFG_DSIZE_24BIT</name>
                  <description>24 Bits Wide (EPI0S0 to EPI0S23)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_GPCFG_DSIZE_32BIT</name>
                  <description>32 Bits Wide (EPI0S0 to EPI0S31)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_GPCFG_ASIZE</name>
              <description>Address Bus Size</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_GPCFG_ASIZE_NONE</name>
                  <description>No address</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_GPCFG_ASIZE_4BIT</name>
                  <description>Up to 4 bits wide</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_GPCFG_ASIZE_12BIT</name>
                  <description>Up to 12 bits wide. This size cannot be used with 24-bit data</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_GPCFG_ASIZE_20BIT</name>
                  <description>Up to 20 bits wide. This size cannot be used with data sizes other than 8</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_GPCFG_WR2CYC</name>
              <description>2-Cycle Writes</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>EPI_GPCFG_FRMCNT</name>
              <description>Frame Count</description>
              <bitRange>[25:22]</bitRange>
            </field>
            <field>
              <name>EPI_GPCFG_FRM50</name>
              <description>50/50 Frame</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>EPI_GPCFG_CLKGATE</name>
              <description>Clock Gated</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>EPI_GPCFG_CLKPIN</name>
              <description>Clock Pin</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SDRAMCFG</name>
          <description>EPI SDRAM Configuration</description>
          <alternateGroup>EPI_ALTSD</alternateGroup>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>EPI_SDRAMCFG_SIZE</name>
              <description>Size of SDRAM</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_SDRAMCFG_SIZE_8MB</name>
                  <description>64 megabits (8MB)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_SDRAMCFG_SIZE_16MB</name>
                  <description>128 megabits (16MB)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_SDRAMCFG_SIZE_32MB</name>
                  <description>256 megabits (32MB)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_SDRAMCFG_SIZE_64MB</name>
                  <description>512 megabits (64MB)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_SDRAMCFG_SLEEP</name>
              <description>Sleep Mode</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EPI_SDRAMCFG_RFSH</name>
              <description>Refresh Counter</description>
              <bitRange>[26:16]</bitRange>
            </field>
            <field>
              <name>EPI_SDRAMCFG_FREQ</name>
              <description>EPI Frequency Range</description>
              <bitRange>[31:30]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_SDRAMCFG_FREQ_NONE</name>
                  <description>0 - 15 MHz</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_SDRAMCFG_FREQ_15MHZ</name>
                  <description>15 - 30 MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_SDRAMCFG_FREQ_30MHZ</name>
                  <description>30 - 50 MHz</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HB8CFG</name>
          <description>EPI Host-Bus 8 Configuration</description>
          <alternateGroup>EPI_ALT8</alternateGroup>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>EPI_HB8CFG_MODE</name>
              <description>Host Bus Sub-Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB8CFG_MODE_MUX</name>
                  <description>ADMUX - AD[7:0]</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG_MODE_NMUX</name>
                  <description>ADNONMUX - D[7:0]</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG_MODE_SRAM</name>
                  <description>Continuous Read - D[7:0]</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG_MODE_FIFO</name>
                  <description>XFIFO - D[7:0]</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB8CFG_RDWS</name>
              <description>Read Wait States</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB8CFG_RDWS_2</name>
                  <description>Active RDn is 2 EPI clocks</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG_RDWS_4</name>
                  <description>Active RDn is 4 EPI clocks</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG_RDWS_6</name>
                  <description>Active RDn is 6 EPI clocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG_RDWS_8</name>
                  <description>Active RDn is 8 EPI clocks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB8CFG_WRWS</name>
              <description>Write Wait States</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB8CFG_WRWS_2</name>
                  <description>Active WRn is 2 EPI clocks</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG_WRWS_4</name>
                  <description>Active WRn is 4 EPI clocks</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG_WRWS_6</name>
                  <description>Active WRn is 6 EPI clocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG_WRWS_8</name>
                  <description>Active WRn is 8 EPI clocks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB8CFG_MAXWAIT</name>
              <description>Maximum Wait</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>EPI_HB8CFG_ALEHIGH</name>
              <description>ALE Strobe Polarity</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>EPI_HB8CFG_RDHIGH</name>
              <description>READ Strobe Polarity</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EPI_HB8CFG_WRHIGH</name>
              <description>WRITE Strobe Polarity</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EPI_HB8CFG_XFEEN</name>
              <description>External FIFO EMPTY Enable</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>EPI_HB8CFG_XFFEN</name>
              <description>External FIFO FULL Enable</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>EPI_HB8CFG_IRDYINV</name>
              <description>Input Ready Invert</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>EPI_HB8CFG_RDYEN</name>
              <description>Input Ready Enable</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>EPI_HB8CFG_CLKINV</name>
              <description>Invert Output Clock Enable</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>EPI_HB8CFG_CLKGATEI</name>
              <description>Clock Gated when Idle</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>EPI_HB8CFG_CLKGATE</name>
              <description>Clock Gated</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
