cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432E401Y.svd
        <register>
          <name>STATUS</name>
          <description>Ethernet MAC Status</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>EMAC_STATUS_RPE</name>
              <description>MAC MII Receive Protocol Engine Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EMAC_STATUS_RFCFC</name>
              <description>MAC Receive Frame Controller FIFO Status</description>
              <bitRange>[2:1]</bitRange>
            </field>
            <field>
              <name>EMAC_STATUS_RWC</name>
              <description>TX/RX Controller RX FIFO Write Controller Active Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EMAC_STATUS_RRC</name>
              <description>TX/RX Controller Read Controller State</description>
              <bitRange>[6:5]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_STATUS_RRC_IDLE</name>
                  <description>IDLE state</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_STATUS_RRC_STATUS</name>
                  <description>Reading frame data</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_STATUS_RRC_DATA</name>
                  <description>Reading frame status (or timestamp)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_STATUS_RRC_FLUSH</name>
                  <description>Flushing the frame data and status</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_STATUS_RXF</name>
              <description>TX/RX Controller RX FIFO Fill-level Status</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_STATUS_RXF_EMPTY</name>
                  <description>RX FIFO Empty</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_STATUS_RXF_BELOW</name>
                  <description>RX FIFO fill level is below the flow-control deactivate threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_STATUS_RXF_ABOVE</name>
                  <description>RX FIFO fill level is above the flow-control activate threshold</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_STATUS_RXF_FULL</name>
                  <description>RX FIFO Full</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_STATUS_TPE</name>
              <description>MAC MII Transmit Protocol Engine Status</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EMAC_STATUS_TFC</name>
              <description>MAC Transmit Frame Controller Status</description>
              <bitRange>[18:17]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_STATUS_TFC_IDLE</name>
                  <description>IDLE state</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_STATUS_TFC_STATUS</name>
                  <description>Waiting for status of previous frame or IFG or backoff period to be over</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_STATUS_TFC_PAUSE</name>
                  <description>Generating and transmitting a PAUSE control frame (in the full-duplex mode)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_STATUS_TFC_INPUT</name>
                  <description>Transferring input frame for transmission</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_STATUS_TXPAUSED</name>
              <description>MAC Transmitter PAUSE</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>EMAC_STATUS_TRC</name>
              <description>TX/RX Controller's TX FIFO Read Controller Status</description>
              <bitRange>[21:20]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_STATUS_TRC_IDLE</name>
                  <description>IDLE state</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_STATUS_TRC_READ</name>
                  <description>READ state (transferring data to MAC transmitter)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_STATUS_TRC_WAIT</name>
                  <description>Waiting for TX Status from MAC transmitter</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_STATUS_TRC_WRFLUSH</name>
                  <description>Writing the received TX Status or flushing the TX FIFO</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_STATUS_TWC</name>
              <description>TX/RX Controller TX FIFO Write Controller Active Status</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>EMAC_STATUS_TXFE</name>
              <description>TX/RX Controller TX FIFO Not Empty Status</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>EMAC_STATUS_TXFF</name>
              <description>TX/RX Controller TX FIFO Full Status</description>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RWUFF</name>
          <description>Ethernet MAC Remote Wake-Up Frame Filter</description>
          <addressOffset>0x00000028</addressOffset>
          <fields>
            <field>
              <name>EMAC_RWUFF_WAKEUPFIL</name>
              <description>Remote Wake-Up Frame Filter</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMTCTLSTAT</name>
          <description>Ethernet MAC PMT Control and Status Register</description>
          <addressOffset>0x0000002C</addressOffset>
          <fields>
            <field>
              <name>EMAC_PMTCTLSTAT_PWRDWN</name>
              <description>Power Down</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EMAC_PMTCTLSTAT_MGKPKTEN</name>
              <description>Magic Packet Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EMAC_PMTCTLSTAT_WUPFREN</name>
              <description>Wake-Up Frame Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EMAC_PMTCTLSTAT_MGKPRX</name>
              <description>Magic Packet Received</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EMAC_PMTCTLSTAT_WUPRX</name>
              <description>Wake-Up Frame Received</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EMAC_PMTCTLSTAT_GLBLUCAST</name>
              <description>Global Unicast</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EMAC_PMTCTLSTAT_RWKPTR</name>
              <description>Remote Wake-Up FIFO Pointer</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>EMAC_PMTCTLSTAT_WUPFRRST</name>
              <description>Wake-Up Frame Filter Register Pointer Reset</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LPICTLSTAT</name>
          <description>Ethernet MAC Low Power Idle Control and Status Register</description>
          <addressOffset>0x00000030</addressOffset>
            <fields>
                <field>
                    <name>EMAC_LPICTLSTAT_TLPIEN</name>
                    <description>Transmit LPI Entry</description>
                    <bitRange>[0:0]</bitRange>
                </field>
                <field>
                    <name>EMAC_LPICTLSTAT_TLPIEX</name>
                    <description>Transmit LPI Exit</description>
                    <bitRange>[1:1]</bitRange>
                </field>
                <field>
                    <name>EMAC_LPICTLSTAT_RLPIEN</name>
                    <description>Receive LPI Entry</description>
                    <bitRange>[2:2]</bitRange>
                </field>
                <field>
                    <name>EMAC_LPICTLSTAT_RLPIEX</name>
                    <description>Receive LPI Exit</description>
                    <bitRange>[3:3]</bitRange>
                </field>
                <field>
                    <name>EMAC_LPICTLSTAT_TLPIST</name>
                    <description>Transmit LPI State</description>
                    <bitRange>[8:8]</bitRange>
                </field>
                <field>
                    <name>EMAC_LPICTLSTAT_RLPIST</name>
                    <description>Receive LPI State</description>
                    <bitRange>[9:9]</bitRange>
                </field>
                <field>
                    <name>EMAC_LPICTLSTAT_LPIEN</name>
                    <description>LPI Enable</description>
                    <bitRange>[16:16]</bitRange>
                </field>
                <field>
                    <name>EMAC_LPICTLSTAT_PLS</name>
                    <description>PHY Link Status</description>
                    <bitRange>[17:17]</bitRange>
                </field>
                <field>
                    <name>EMAC_LPICTLSTAT_PLSEN</name>
                    <description>PHY Link Status Enable</description>
                    <bitRange>[18:18]</bitRange>
                </field>
                <field>
                    <name>EMAC_LPICTLSTAT_LPITXA</name>
                    <description>LPI TX Automate</description>
                    <bitRange>[19:19]</bitRange>
                </field>
            </fields>
        </register>
        <register>
          <name>LPITIMERCTL</name>
          <description>Ethernet MAC Low Power Idle Timer Control Register</description>
          <addressOffset>0x00000034</addressOffset>
          <fields>
            <field>
                <name>EMAC_LPITIMERCTL_TWT</name>
                <description>LPI TW Timer</description>
                <bitRange>[15:0]</bitRange>
            </field>
            <field>
                <name>EMAC_LPITIMERCTL_LST</name>
                <description>LPI LS Timer</description>
                <bitRange>[25:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>Ethernet MAC Raw Interrupt Status</description>
          <addressOffset>0x00000038</addressOffset>
          <fields>
            <field>
              <name>EMAC_RIS_PMT</name>
              <description>PMT Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EMAC_RIS_MMC</name>
              <description>MMC Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EMAC_RIS_MMCRX</name>
              <description>MMC Receive Interrupt Status</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EMAC_RIS_MMCTX</name>
              <description>MMC Transmit Interrupt Status</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EMAC_RIS_TS</name>
              <description>Timestamp Interrupt Status</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
                <name>EMAC_RIS_LPI</name>
                <description>LPI Interrupt Status</description>
                <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <description>Ethernet MAC Interrupt Mask</description>
          <addressOffset>0x0000003C</addressOffset>
          <fields>
            <field>
              <name>EMAC_IM_PMT</name>
              <description>PMT Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EMAC_IM_TSI</name>
              <description>Timestamp Interrupt Mask</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
                <name>EMAC_IM_LPII</name>
                <description>LPI Interrupt Mask</description>
                <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR0H</name>
          <description>Ethernet MAC Address 0 High</description>
          <addressOffset>0x00000040</addressOffset>
          <fields>
            <field>
              <name>EMAC_ADDR0H_ADDRHI</name>
              <description>MAC Address0 [47:32]</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>EMAC_ADDR0H_AE</name>
              <description>Address Enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR0L</name>
          <description>Ethernet MAC Address 0 Low Register</description>
          <addressOffset>0x00000044</addressOffset>
          <fields>
            <field>
              <name>EMAC_ADDR0L_ADDRLO</name>
              <description>MAC Address0 [31:0]</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR1H</name>
          <description>Ethernet MAC Address 1 High</description>
          <addressOffset>0x00000048</addressOffset>
          <fields>
            <field>
              <name>EMAC_ADDR1H_ADDRHI</name>
              <description>MAC Address1 [47:32]</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>EMAC_ADDR1H_MBC</name>
              <description>Mask Byte Control</description>
              <bitRange>[29:24]</bitRange>
            </field>
            <field>
              <name>EMAC_ADDR1H_SA</name>
              <description>Source Address</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>EMAC_ADDR1H_AE</name>
              <description>Address Enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR1L</name>
          <description>Ethernet MAC Address 1 Low</description>
          <addressOffset>0x0000004C</addressOffset>
          <fields>
            <field>
              <name>EMAC_ADDR1L_ADDRLO</name>
              <description>MAC Address1 [31:0]</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR2H</name>
          <description>Ethernet MAC Address 2 High</description>
          <addressOffset>0x00000050</addressOffset>
          <fields>
            <field>
              <name>EMAC_ADDR2H_ADDRHI</name>
              <description>MAC Address2 [47:32]</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>EMAC_ADDR2H_MBC</name>
              <description>Mask Byte Control</description>
              <bitRange>[29:24]</bitRange>
            </field>
            <field>
              <name>EMAC_ADDR2H_SA</name>
              <description>Source Address</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>EMAC_ADDR2H_AE</name>
              <description>Address Enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR2L</name>
          <description>Ethernet MAC Address 2 Low</description>
          <addressOffset>0x00000054</addressOffset>
          <fields>
            <field>
              <name>EMAC_ADDR2L_ADDRLO</name>
              <description>MAC Address2 [31:0]</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR3H</name>
          <description>Ethernet MAC Address 3 High</description>
          <addressOffset>0x00000058</addressOffset>
          <fields>
            <field>
              <name>EMAC_ADDR3H_ADDRHI</name>
              <description>MAC Address3 [47:32]</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>EMAC_ADDR3H_MBC</name>
              <description>Mask Byte Control</description>
              <bitRange>[29:24]</bitRange>
            </field>
            <field>
              <name>EMAC_ADDR3H_SA</name>
              <description>Source Address</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>EMAC_ADDR3H_AE</name>
              <description>Address Enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR3L</name>
          <description>Ethernet MAC Address 3 Low</description>
          <addressOffset>0x0000005C</addressOffset>
          <fields>
            <field>
              <name>EMAC_ADDR3L_ADDRLO</name>
              <description>MAC Address3 [31:0]</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WDOGTO</name>
          <description>Ethernet MAC Watchdog Timeout</description>
          <addressOffset>0x000000DC</addressOffset>
          <fields>
            <field>
              <name>EMAC_WDOGTO_WTO</name>
              <description>Watchdog Timeout</description>
              <bitRange>[13:0]</bitRange>
            </field>
            <field>
              <name>EMAC_WDOGTO_PWE</name>
              <description>Programmable Watchdog Enable</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCCTRL</name>
          <description>Ethernet MAC MMC Control</description>
          <addressOffset>0x00000100</addressOffset>
          <fields>
            <field>
              <name>EMAC_MMCCTRL_CNTRST</name>
              <description>Counters Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EMAC_MMCCTRL_CNTSTPRO</name>
              <description>Counters Stop Rollover</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EMAC_MMCCTRL_RSTONRD</name>
              <description>Reset on Read</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EMAC_MMCCTRL_CNTFREEZ</name>
              <description>MMC Counter Freeze</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EMAC_MMCCTRL_CNTPRST</name>
              <description>Counters Preset</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EMAC_MMCCTRL_CNTPRSTLVL</name>
              <description>Full/Half Preset Level Value</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EMAC_MMCCTRL_UCDBC</name>
              <description>Update MMC Counters for Dropped Broadcast Frames</description>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCRXRIS</name>
          <description>Ethernet MAC MMC Receive Raw Interrupt Status</description>
          <addressOffset>0x00000104</addressOffset>
          <fields>
            <field>
              <name>EMAC_MMCRXRIS_GBF</name>
              <description>MMC Receive Good Bad Frame Counter Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EMAC_MMCRXRIS_CRCERR</name>
              <description>MMC Receive CRC Error Frame Counter Interrupt Status</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EMAC_MMCRXRIS_ALGNERR</name>
              <description>MMC Receive Alignment Error Frame Counter Interrupt Status</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EMAC_MMCRXRIS_UCGF</name>
              <description>MMC Receive Unicast Good Frame Counter Interrupt Status</description>
              <bitRange>[17:17]</bitRange>
            </field>
          </fields>
        </register>
