cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432E401Y.svd
        <register>
          <name>PPSCTRL</name>
          <description>Ethernet MAC PPS Control</description>
          <addressOffset>0x0000072C</addressOffset>
          <fields>
            <field>
              <name>EMAC_PPSCTRL_PPSCTRL</name>
              <description>EN0PPS Output Frequency Control (PPSCTRL) or Command Control (PPSCMD)</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_1HZ</name>
                  <description>When the PPSEN0 bit = 0x0, the EN0PPS signal is 1 pulse of the PTP reference clock.(of width clk_ptp_i) every second</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_2HZ</name>
                  <description>When the PPSEN0 bit = 0x0, the binary rollover is 2 Hz, and the digital rollover is 1 Hz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_4HZ</name>
                  <description>When the PPSEN0 bit = 0x0, the binary rollover is 4 Hz, and the digital rollover is 2 Hz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_8HZ</name>
                  <description>When thePPSEN0 bit = 0x0, the binary rollover is 8 Hz, and the digital rollover is 4 Hz,</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_16HZ</name>
                  <description>When thePPSEN0 bit = 0x0, the binary rollover is 16 Hz, and the digital rollover is 8 Hz</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_32HZ</name>
                  <description>When thePPSEN0 bit = 0x0, the binary rollover is 32 Hz, and the digital rollover is 16 Hz</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_64HZ</name>
                  <description>When thePPSEN0 bit = 0x0, the binary rollover is 64 Hz, and the digital rollover is 32 Hz</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_128HZ</name>
                  <description>When thePPSEN0 bit = 0x0, the binary rollover is 128 Hz, and the digital rollover is 64 Hz</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_256HZ</name>
                  <description>When thePPSEN0 bit = 0x0, the binary rollover is 256 Hz, and the digital rollover is 128 Hz</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_512HZ</name>
                  <description>When thePPSEN0 bit = 0x0, the binary rollover is 512 Hz, and the digital rollover is 256 Hz</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_1024HZ</name>
                  <description>When the PPSEN0 bit = 0x0, the binary rollover is 1.024 kHz, and the digital rollover is 512 Hz</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_2048HZ</name>
                  <description>When thePPSEN0 bit = 0x0, the binary rollover is 2.048 kHz, and the digital rollover is 1.024 kHz</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_4096HZ</name>
                  <description>When thePPSEN0 bit = 0x0, the binary rollover is 4.096 kHz, and the digital rollover is 2.048 kHz</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_8192HZ</name>
                  <description>When thePPSEN0 bit = 0x0, the binary rollover is 8.192 kHz, and the digital rollover is 4.096 kHz</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_16384HZ</name>
                  <description>When thePPSEN0 bit = 0x0, the binary rollover is 16.384 kHz, and the digital rollover is 8.092 kHz</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_32768HZ</name>
                  <description>When thePPSEN0 bit = 0x0, the binary rollover is 32.768 KHz, and the digital rollover is 16.384 KHz</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_PPSCTRL_PPSEN0</name>
              <description>Flexible PPS Output Mode Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EMAC_PPSCTRL_TRGMODS0</name>
              <description>Target Time Register Mode for PPS0 Output</description>
              <bitRange>[6:5]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_TRGMODS0_INTONLY</name>
                  <description>Indicates that the Target Time registers are programmed only for generating the interrupt event</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_TRGMODS0_INTPPS0</name>
                  <description>Indicates that the Target Time registers are programmed for generating the interrupt event and starting or stopping the generation of the EN0PPS output signal</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_TRGMODS0_PPS0ONLY</name>
                  <description>Indicates that the Target Time registers are programmed only for starting or stopping the generation of the EN0PPS output signal. No interrupt is asserted</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PPS0INTVL</name>
          <description>Ethernet MAC PPS0 Interval</description>
          <addressOffset>0x00000760</addressOffset>
          <fields>
            <field>
              <name>EMAC_PPS0INTVL_PPS0INT</name>
              <description>PPS0 Output Signal Interval</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPS0WIDTH</name>
          <description>Ethernet MAC PPS0 Width</description>
          <addressOffset>0x00000764</addressOffset>
          <fields>
            <field>
              <name>EMAC_PPS0WIDTH</name>
              <description>EN0PPS Output Signal Width</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMABUSMOD</name>
          <description>Ethernet MAC DMA Bus Mode</description>
          <addressOffset>0x00000C00</addressOffset>
          <fields>
            <field>
              <name>EMAC_DMABUSMOD_SWR</name>
              <description>DMA Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_DA</name>
              <description>DMA Arbitration Scheme</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_DSL</name>
              <description>Descriptor Skip Length</description>
              <bitRange>[6:2]</bitRange>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_ATDS</name>
              <description>Alternate Descriptor Size</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_PBL</name>
              <description>Programmable Burst Length</description>
              <bitRange>[13:8]</bitRange>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_PR</name>
              <description>Priority Ratio</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_FB</name>
              <description>Fixed Burst</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_RPBL</name>
              <description>RX DMA Programmable Burst Length (PBL)</description>
              <bitRange>[22:17]</bitRange>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_USP</name>
              <description>Use Separate Programmable Burst Length (PBL)</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_8XPBL</name>
              <description>8 x Programmable Burst Length (PBL) Mode</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_AAL</name>
              <description>Address Aligned Beats</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_MB</name>
              <description>Mixed Burst</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_TXPR</name>
              <description>Transmit Priority</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>EMAC_DMABUSMOD_RIB</name>
              <description>Rebuild Burst</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXPOLLD</name>
          <description>Ethernet MAC Transmit Poll Demand</description>
          <addressOffset>0x00000C04</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>EMAC_TXPOLLD_TPD</name>
              <description>Transmit Poll Demand</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXPOLLD</name>
          <description>Ethernet MAC Receive Poll Demand</description>
          <addressOffset>0x00000C08</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>EMAC_RXPOLLD_RPD</name>
              <description>Receive Poll Demand</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDLADDR</name>
          <description>Ethernet MAC Receive Descriptor List Address</description>
          <addressOffset>0x00000C0C</addressOffset>
          <fields>
            <field>
              <name>EMAC_RXDLADDR_STRXLIST</name>
              <description>Start of Receive List</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDLADDR</name>
          <description>Ethernet MAC Transmit Descriptor List Address</description>
          <addressOffset>0x00000C10</addressOffset>
          <fields>
            <field>
              <name>EMAC_TXDLADDR_TXDLADDR</name>
              <description>Start of Transmit List Base Address</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMARIS</name>
          <description>Ethernet MAC DMA Interrupt Status</description>
          <addressOffset>0x00000C14</addressOffset>
          <fields>
            <field>
              <name>EMAC_DMARIS_TI</name>
              <description>Transmit Interrupt</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_TPS</name>
              <description>Transmit Process Stopped</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_TU</name>
              <description>Transmit Buffer Unavailable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_TJT</name>
              <description>Transmit Jabber Timeout</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_OVF</name>
              <description>Receive Overflow</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_UNF</name>
              <description>Transmit Underflow</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_RI</name>
              <description>Receive Interrupt</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_RU</name>
              <description>Receive Buffer Unavailable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_RPS</name>
              <description>Receive Process Stopped</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_RWT</name>
              <description>Receive Watchdog Timeout</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_ETI</name>
              <description>Early Transmit Interrupt</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_FBI</name>
              <description>Fatal Bus Error Interrupt</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_ERI</name>
              <description>Early Receive Interrupt</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_AIS</name>
              <description>Abnormal Interrupt Summary</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_NIS</name>
              <description>Normal Interrupt Summary</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_RS</name>
              <description>Received Process State</description>
              <bitRange>[19:17]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_DMARIS_RS_STOP</name>
                  <description>Stopped: Reset or stop receive command issued</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_RS_RUNRXTD</name>
                  <description>Running: Fetching receive transfer descriptor</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_RS_RUNRXD</name>
                  <description>Running: Waiting for receive packet</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_RS_SUSPEND</name>
                  <description>Suspended: Receive descriptor unavailable</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_RS_RUNCRD</name>
                  <description>Running: Closing receive descriptor</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_RS_TSWS</name>
                  <description>Writing Timestamp</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_RS_RUNTXD</name>
                  <description>Running: Transferring the receive packet data from receive buffer to host memory</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_DMARIS_TS</name>
              <description>Transmit Process State</description>
              <bitRange>[22:20]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_DMARIS_TS_STOP</name>
                  <description>Stopped; Reset or Stop transmit command processed</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_TS_RUNTXTD</name>
                  <description>Running; Fetching transmit transfer descriptor</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_TS_STATUS</name>
                  <description>Running; Waiting for status</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_TS_RUNTX</name>
                  <description>Running; Reading data from host memory buffer and queuing it to transmit buffer (TX FIFO)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_TS_TSTAMP</name>
                  <description>Writing Timestamp</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_TS_SUSPEND</name>
                  <description>Suspended; Transmit descriptor unavailable or transmit buffer underflow</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_TS_RUNCTD</name>
                  <description>Running; Closing transmit descriptor</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_DMARIS_AE</name>
              <description>Access Error</description>
              <bitRange>[25:23]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_DMARIS_AE_RXDMAWD</name>
                  <description>Error during RX DMA Write Data Transfer</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_AE_TXDMARD</name>
                  <description>Error during TX DMA Read Data Transfer</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_AE_RXDMADW</name>
                  <description>Error during RX DMA Descriptor Write Access</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_AE_TXDMADW</name>
                  <description>Error during TX DMA Descriptor Write Access</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_AE_RXDMADR</name>
                  <description>Error during RX DMA Descriptor Read Access</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMARIS_AE_TXDMADR</name>
                  <description>Error during TX DMA Descriptor Read Access</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_DMARIS_MMC</name>
              <description>MAC MMC Interrupt</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_PMT</name>
              <description>MAC PMT Interrupt Status</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>EMAC_DMARIS_TT</name>
              <description>Timestamp Trigger Interrupt Status</description>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
