cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432E401Y.svd
        <register>
          <name>DMAOPMODE</name>
          <description>Ethernet MAC DMA Operation Mode</description>
          <addressOffset>0x00000C18</addressOffset>
          <fields>
            <field>
              <name>EMAC_DMAOPMODE_SR</name>
              <description>Start or Stop Receive</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_OSF</name>
              <description>Operate on Second Frame</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_RTC</name>
              <description>Receive Threshold Control</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_RTC_64</name>
                  <description>64 bytes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_RTC_32</name>
                  <description>32 bytes</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_RTC_96</name>
                  <description>96 bytes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_RTC_128</name>
                  <description>128 bytes</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_DGF</name>
              <description>Drop Giant Frame Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_FUF</name>
              <description>Forward Undersized Good Frames</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_FEF</name>
              <description>Forward Error Frames</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_ST</name>
              <description>Start or Stop Transmission Command</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_TTC</name>
              <description>Transmit Threshold Control</description>
              <bitRange>[16:14]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_TTC_64</name>
                  <description>64 bytes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_TTC_128</name>
                  <description>128 bytes</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_TTC_192</name>
                  <description>192 bytes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_TTC_256</name>
                  <description>256 bytes</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_TTC_40</name>
                  <description>40 bytes</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_TTC_32</name>
                  <description>32 bytes</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_TTC_24</name>
                  <description>24 bytes</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_DMAOPMODE_TTC_16</name>
                  <description>16 bytes</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_FTF</name>
              <description>Flush Transmit FIFO</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_TSF</name>
              <description>Transmit Store and Forward</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_DFF</name>
              <description>Disable Flushing of Received Frames</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_RSF</name>
              <description>Receive Store and Forward</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAOPMODE_DT</name>
              <description>Disable Dropping of TCP/IP Checksum Error Frames</description>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAIM</name>
          <description>Ethernet MAC DMA Interrupt Mask Register</description>
          <addressOffset>0x00000C1C</addressOffset>
          <fields>
            <field>
              <name>EMAC_DMAIM_TIE</name>
              <description>Transmit Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAIM_TSE</name>
              <description>Transmit Stopped Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAIM_TUE</name>
              <description>Transmit Buffer Unvailable Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAIM_TJE</name>
              <description>Transmit Jabber Timeout Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAIM_OVE</name>
              <description>Overflow Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAIM_UNE</name>
              <description>Underflow Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAIM_RIE</name>
              <description>Receive Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAIM_RUE</name>
              <description>Receive Buffer Unavailable Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAIM_RSE</name>
              <description>Receive Stopped Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAIM_RWE</name>
              <description>Receive Watchdog Timeout Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAIM_ETE</name>
              <description>Early Transmit Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAIM_FBE</name>
              <description>Fatal Bus Error Enable</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAIM_ERE</name>
              <description>Early Receive Interrupt Enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAIM_AIE</name>
              <description>Abnormal Interrupt Summary Enable</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EMAC_DMAIM_NIE</name>
              <description>Normal Interrupt Summary Enable</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MFBOC</name>
          <description>Ethernet MAC Missed Frame and Buffer Overflow Counter</description>
          <addressOffset>0x00000C20</addressOffset>
          <fields>
            <field>
              <name>EMAC_MFBOC_MISFRMCNT</name>
              <description>Missed Frame Counter</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>EMAC_MFBOC_MISCNTOVF</name>
              <description>Overflow bit for Missed Frame Counter</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EMAC_MFBOC_OVFFRMCNT</name>
              <description>Overflow Frame Counter</description>
              <bitRange>[27:17]</bitRange>
            </field>
            <field>
              <name>EMAC_MFBOC_OVFCNTOVF</name>
              <description>Overflow Bit for FIFO Overflow Counter</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXINTWDT</name>
          <description>Ethernet MAC Receive Interrupt Watchdog Timer</description>
          <addressOffset>0x00000C24</addressOffset>
          <fields>
            <field>
              <name>EMAC_RXINTWDT_RIWT</name>
              <description>Receive Interrupt Watchdog Timer Count</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HOSTXDESC</name>
          <description>Ethernet MAC Current Host Transmit Descriptor</description>
          <addressOffset>0x00000C48</addressOffset>
          <fields>
            <field>
              <name>EMAC_HOSTXDESC_CURTXDESC</name>
              <description>Host Transmit Descriptor Address Pointer</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HOSRXDESC</name>
          <description>Ethernet MAC Current Host Receive Descriptor</description>
          <addressOffset>0x00000C4C</addressOffset>
          <fields>
            <field>
              <name>EMAC_HOSRXDESC_CURRXDESC</name>
              <description>Host Receive Descriptor Address Pointer</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HOSTXBA</name>
          <description>Ethernet MAC Current Host Transmit Buffer Address</description>
          <addressOffset>0x00000C50</addressOffset>
          <fields>
            <field>
              <name>EMAC_HOSTXBA_CURTXBUFA</name>
              <description>Host Transmit Buffer Address Pointer</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HOSRXBA</name>
          <description>Ethernet MAC Current Host Receive Buffer Address</description>
          <addressOffset>0x00000C54</addressOffset>
          <fields>
            <field>
              <name>EMAC_HOSRXBA_CURRXBUFA</name>
              <description>Host Receive Buffer Address Pointer</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <description>Ethernet MAC Peripheral Property Register</description>
          <addressOffset>0x00000FC0</addressOffset>
          <fields>
            <field>
              <name>EMAC_PP_PHYTYPE</name>
              <description>Ethernet PHY Type</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_PP_PHYTYPE_NONE</name>
                  <description>No PHY</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PP_PHYTYPE_1</name>
                  <description>Snowflake class PHY</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_PP_MACTYPE</name>
              <description>Ethernet MAC Type</description>
              <bitRange>[10:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PC</name>
          <description>Ethernet MAC Peripheral Configuration Register</description>
          <addressOffset>0x00000FC4</addressOffset>
          <fields>
            <field>
              <name>EMAC_PC_PHYHOLD</name>
              <description>Ethernet PHY Hold</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EMAC_PC_ANMODE</name>
              <description>Auto Negotiation Mode</description>
              <bitRange>[2:1]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_PC_ANMODE_10HD</name>
                  <description>When ANEN = 0x0, the mode is 10Base-T, Half-Duplex</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PC_ANMODE_10FD</name>
                  <description>When ANEN = 0x0, the mode is 10Base-T, Full-Duplex</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PC_ANMODE_100HD</name>
                  <description>When ANEN = 0x0, the mode is 100Base-TX, Half-Duplex</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PC_ANMODE_100FD</name>
                  <description>When ANEN = 0x0, the mode is 100Base-TX, Full-Duplex</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_PC_ANEN</name>
              <description>Auto Negotiation Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EMAC_PC_FASTANSEL</name>
              <description>Fast Auto Negotiation Select</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>EMAC_PC_FASTANEN</name>
              <description>Fast Auto Negotiation Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EMAC_PC_EXTFD</name>
              <description>Extended Full Duplex Ability</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EMAC_PC_FASTLUPD</name>
              <description>FAST Link-Up in Parallel Detect</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EMAC_PC_FASTRXDV</name>
              <description>Fast RXDV Detection</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EMAC_PC_MDIXEN</name>
              <description>MDIX Enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>EMAC_PC_FASTMDIX</name>
              <description>Fast Auto MDI-X</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>EMAC_PC_RBSTMDIX</name>
              <description>Robust Auto MDI-X</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>EMAC_PC_MDISWAP</name>
              <description>MDI Swap</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EMAC_PC_POLSWAP</name>
              <description>Polarity Swap</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>EMAC_PC_FASTLDMODE</name>
              <description>Fast Link Down Mode</description>
              <bitRange>[19:15]</bitRange>
            </field>
            <field>
              <name>EMAC_PC_TDRRUN</name>
              <description>TDR Auto Run</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EMAC_PC_LRR</name>
              <description>Link Loss Recovery</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EMAC_PC_ISOMIILL</name>
              <description>Isolate MII in Link Loss</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>EMAC_PC_RXERIDLE</name>
              <description>RXER Detection During Idle</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>EMAC_PC_NIBDETDIS</name>
              <description>Odd Nibble TXER Detection Disable</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>EMAC_PC_DIGRESTART</name>
              <description>PHY Soft Restart</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>EMAC_PC_PINTFS</name>
              <description>Ethernet Interface Select</description>
              <bitRange>[30:28]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_PC_PINTFS_IMII</name>
                  <description>MII (default) Used for internal PHY or external PHY connected via MII</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PC_PINTFS_RMII</name>
                  <description>RMII: Used for external PHY connected via RMII</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_PC_PHYEXT</name>
              <description>PHY Select</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CC</name>
          <description>Ethernet MAC Clock Configuration Register</description>
          <addressOffset>0x00000FC8</addressOffset>
          <fields>
            <field>
              <name>EMAC_CC_POL</name>
              <description>LED Polarity Control</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EMAC_CC_PTPCEN</name>
              <description>PTP Clock Reference Enable</description>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EPHYRIS</name>
          <description>Ethernet PHY Raw Interrupt Status</description>
          <addressOffset>0x00000FCC</addressOffset>
          <fields>
            <field>
              <name>EMAC_EPHYRIS_INT</name>
              <description>Ethernet PHY Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EPHYIM</name>
          <description>Ethernet PHY Interrupt Mask</description>
          <addressOffset>0x00000FD0</addressOffset>
          <fields>
            <field>
              <name>EMAC_EPHYIM_INT</name>
              <description>Ethernet PHY Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EPHYMISC</name>
          <description>Ethernet PHY Masked Interrupt Status and Clear</description>
          <addressOffset>0x00000FD4</addressOffset>
          <fields>
            <field>
              <name>EMAC_EPHYMISC_INT</name>
              <description>Ethernet PHY Status and Clear register</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
