cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432E401Y.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DES_DMA</name>
      <description>Register map for DES DMA peripheral</description>
      <groupName>DES_DMA</groupName>
      <prependToName>DES_DMA</prependToName>
      <baseAddress>0x44030030</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000010</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
            <name>DES_DMAIM</name>
            <description>DES DMA Interrupt Mask</description>
            <addressOffset>0x00000000</addressOffset>
            <fields>
                <field>
                    <name>DES_DMAIM_CIN</name>
                    <description>Context In DMA Done Interrupt Mask</description>
                    <bitRange>[0:0]</bitRange>
                </field>
                <field>
                    <name>DES_DMAIM_COUT</name>
                    <description>Context Out DMA Done Interrupt Mask</description>
                    <bitRange>[1:1]</bitRange>
                </field>
                <field>
                    <name>DES_DMAIM_DIN</name>
                    <description>Data In DMA Done Interrupt Mask</description>
                    <bitRange>[2:2]</bitRange>
                </field>
                <field>
                    <name>DES_DMAIM_DOUT</name>
                    <description>Data Out DMA Done Interrupt Mask</description>
                    <bitRange>[3:3]</bitRange>
                </field>
            </fields>
        </register>
        <register>
            <name>DES_DMARIS</name>
            <description>DES DMA Raw Interrupt Status</description>
            <addressOffset>0x00000004</addressOffset>
            <fields>
                <field>
                    <name>DES_DMARIS_CIN</name>
                    <description>Context In DMA Done Raw Interrupt Status</description>
                    <bitRange>[0:0]</bitRange>
                </field>
                <field>
                    <name>DES_DMARIS_COUT</name>
                    <description>Context Out DMA Done Raw Interrupt Status</description>
                    <bitRange>[1:1]</bitRange>
                </field>
                <field>
                    <name>DES_DMARIS_DIN</name>
                    <description>Data In DMA Done Raw Interrupt Status</description>
                    <bitRange>[2:2]</bitRange>
                </field>
                <field>
                    <name>DES_DMARIS_DOUT</name>
                    <description>Data Out DMA Done Raw Interrupt Status</description>
                    <bitRange>[3:3]</bitRange>
                </field>
            </fields>
        </register>
        <register>
            <name>DES_DMAMIS</name>
            <description>DES DMA Masked Interrupt Status</description>
            <addressOffset>0x00000008</addressOffset>
            <fields>
                <field>
                    <name>DES_DMAMIS_CIN</name>
                    <description>Context In DMA Done Masked Interrupt Status</description>
                    <bitRange>[0:0]</bitRange>
                </field>
                <field>
                    <name>DES_DMAMIS_COUT</name>
                    <description>Context Out DMA Done Masked Interrupt Status</description>
                    <bitRange>[1:1]</bitRange>
                </field>
                <field>
                    <name>DES_DMAMIS_DIN</name>
                    <description>Data In DMA Done Masked Interrupt Status</description>
                    <bitRange>[2:2]</bitRange>
                </field>
                <field>
                    <name>DES_DMAMIS_DOUT</name>
                    <description>Data Out DMA Done Masked Interrupt Status</description>
                    <bitRange>[3:3]</bitRange>
                </field>
            </fields>
        </register>
        <register>
            <name>DES_DMAIC</name>
            <description>DES DMA Interrupt Clear</description>
            <addressOffset>0x0000000C</addressOffset>
            <fields>
                <field>
                    <name>DES_DMAIC_CIN</name>
                    <description>Context In DMA Done Interrupt Clear</description>
                    <bitRange>[0:0]</bitRange>
                </field>
                <field>
                    <name>DES_DMAIC_COUT</name>
                    <description>Context Out DMA Done Interrupt Clear</description>
                    <bitRange>[1:1]</bitRange>
                </field>
                <field>
                    <name>DES_DMAIC_DIN</name>
                    <description>Data In DMA Done Interrupt Clear</description>
                    <bitRange>[2:2]</bitRange>
                </field>
                <field>
                    <name>DES_DMAIC_DOUT</name>
                    <description>Data Out DMA Done Interrupt Clear</description>
                    <bitRange>[3:3]</bitRange>
                </field>
            </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
  <vendorExtensions>
    <memory>
      <name>FLASH</name>
      <description>FLASH Memory Map for MSP432E401Y</description>
      <baseAddress>0x00000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00100000</size>
        <usage>FLASH Memory</usage>
      </addressBlock>
    </memory>
    <memory>
      <name>ROM</name>
      <description>ROM Memory Map for MSP432E401Y</description>
      <baseAddress>0x01000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00008c00</size>
        <usage>ROM Boot Loader</usage>
      </addressBlock>
    </memory>
    <memory>
      <name>SRAM</name>
      <description>SRAM Memory Map for MSP432E401Y</description>
      <baseAddress>0x20000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00040000</size>
        <usage>SRAM</usage>
      </addressBlock>
    </memory>
  </vendorExtensions>
</device>
